---

C#Visual BasicVisual C++

Revit 2024 API
---
TilePatterns..::..GetTilePattern Method
TilePatterns Class See Also Send Feedback
---

Retrieve a TilePattern object from a built-in type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public TilePattern GetTilePattern(
    	TilePatternsBuiltIn tilePatternBuiltIn
    )

Visual Basic
---

    Public Function GetTilePattern ( _
    	tilePatternBuiltIn As TilePatternsBuiltIn _
    ) As TilePattern

Visual C++
---

    public:
    TilePattern^ GetTilePattern(
    	TilePatternsBuiltIn tilePatternBuiltIn
    )

#### Parameters

tilePatternBuiltIn
    Type: Autodesk.Revit.DB..::..TilePatternsBuiltIn

#### Return Value

A TilePattern object, or nullNothingnullptra null reference (Nothing in Visual Basic) if the document is not a Massing Family.

# See Also

TilePatterns Class

Autodesk.Revit.DB Namespace